In [1]:
import numpy  as np
import pandas as pd

In [7]:
path  = '../data/text/result/dic_cl_sc.txt/'
file1 = 'part-00000'
file2 = 'part-00001'

In [24]:
data1 = open(path + file1,'r')
data2 = open(path + file1,'r')

In [25]:
lines1 = data1.readlines()
lines2 = data2.readlines()

In [26]:
print(len(lines1), len(lines2))

20363 20363

In [11]:
lines1[0]

"(u'', 18582)\n"

In [17]:
lines1[1].split(',')[0]

"(u'CHAMARAM'"

In [33]:
print(lines1[20].split(',')[0].replace("(u'","").replace("'","").strip(), lines1[20].split(',')[1].replace(")","").strip())

FICAVA 15

In [37]:
lines = []
lines.extend(lines1)
lines.extend(lines2)

In [38]:
print(len(lines), len(lines1), len(lines2))

40726 20363 20363

In [39]:
lines[0]

"(u'', 18582)\n"

In [42]:
df = pd.DataFrame(lines, columns =['desc'])

In [43]:
df.head()

                  desc
0       (u'', 18582)\n
1   (u'CHAMARAM', 9)\n
2  (u'INCIDENTE', 1)\n
3     (u'OTARIO', 4)\n
4       (u'OJAN', 1)\n

In [44]:
def desc(txt):
    return txt.split(',')[0].replace("(u'","").replace("'","").strip()

In [48]:
def count(txt):
    return txt.split(',')[1].replace(")","").strip()

In [47]:
desc("(u'CHAMARAM', 9)\n")

'CHAMARAM'

In [49]:
count("(u'CHAMARAM', 9)\n")

'9'

In [50]:
df['TOKEN'] =  df['desc'].apply(lambda x: desc((x)))

In [51]:
df['N']     =  df['desc'].apply(lambda x: count((x)))

In [63]:
df['N']     = pd.to_numeric(df['N'] )

In [64]:
df = df[['TOKEN', 'N']]
df = df.sort_values(by=['N','TOKEN'])

In [67]:
df1 = df[(df['N'] == 1)]

In [69]:
dfN = df[(df['N'] > 1)]

In [70]:
df1.sample(5)

                TOKEN  N
12925         PSEUDOS  1
39004  SUPORTESISTEMA  1
6824        AUTOPECAS  1
26502            PATE  1
19555     MONITORAVAM  1

In [71]:
dfN.sample(5)

            TOKEN   N
13480      ALUGAR   4
12035   CONTROLES   3
16617  NEGLIGENTE  29
29007     FICAVAM   4
30116      NUCLEO  14

In [72]:
df.head()

        TOKEN  N
15586     !!I  1
35949     !!I  1
17136  !?!?!?  1
37499  !?!?!?  1
23360     001  1

In [73]:
path  = '../data/text/'
df.to_csv(path +  'datatext.csv', index=None)
df1.to_csv(path + 'datatext_1.csv', index=None)
dfN.to_csv(path + 'datatext_2.csv', index=None)